src/DataProcessors/ВыполнениеЗаданийДесмы/ВыполнениеЗаданийДесмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыполнениеЗаданийДесмы</name>
</mdclass:DataProcessor>

src/Enums/ПроцессНаДесме/ПроцессНаДесме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПроцессНаДесме</name>
  <enumValues>
    <name>Перемещение</name>
    <comment>Означает документ &quot;ВнПеремОтпуск&quot;.</comment>
  </enumValues>
  <enumValues>
    <name>Прием</name>
    <comment>Означает документ &quot;ВнПеремПриемка&quot;.</comment>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ВыполнениеЗаданийДесмы/Forms/ФормаВыбораПроцессаДесмы/Module.bsl
// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессПеремещение(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаДесме.Перемещение"));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессПрием(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаДесме.Прием"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Открыть форму выполнения.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
&НаКлиенте
Процедура ОткрытьФормуВыполнения(Процесс)

    ПараметрыФормы = Новый Структура("Комплектовщик, Процесс", ФормаКомплектовщик, Процесс);
    ОткрытьФорму("Обработка.ВыполнениеЗаданийДесмы.Форма.ФормаВыполнения", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти
